package java_basics;

/*   정수형 타입
	- byte : 1byte
	- short : 2byte
	- int : 4byte
	- long : 8byte
	-> 리터럴 갋인 숫자는, 숫자만 작성을 하면 int 형으로 인식, 숫자 뒤에 L을 붙이면 long 형 ex) 4L
	
	  실수형 타입
	  - float : 4byte
	  - double : 8byte
	  
	  / : 나눠서 몫만
	  % : 나눠서 나머지만
	  
	  조건문
	  
	  if(조건문1){
	  조건문1이 참일 경우 실행되는 문장 // 중괄호로 안쌓여져 있을 경우, 위의 한줄만 실행된다.
	  }else if(조건문2){
	  조건문2가 참일 경우 실행되는 문장
	  }else(조건문3){
	  조건문3이 참일 경우 실행되는 문장
	  }
	  
	  삼항연산자
	  조건식 ? 반환값1(참일 경우) : 반환값2(거짓일 경우);
*/

